references/singlephase/template/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    Reactor_Wall
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }

    LiquidLevel
    {
        type            symmetry;
    }

    Baffles
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }

    Impeller_1
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }

    Impeller_2
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }

    Impeller_3
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }

    Impeller_4
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }

    Shaft
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }
}

// ************************************************************************* //
