references/singlephase/template/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Kinematic pressure p/rho [m^2/s^2]
dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Reactor_Wall    { type zeroGradient; }
    LiquidLevel     { type symmetry; }
    Baffles         { type zeroGradient; }
    Impeller_1      { type zeroGradient; }
    Impeller_2      { type zeroGradient; }
    Impeller_3      { type zeroGradient; }
    Impeller_4      { type zeroGradient; }
    Shaft           { type zeroGradient; }
}

// ************************************************************************* //
